import pandas as pd


def process_data(
    raw_file,
    산지공판장_file,
    전국도매_file,
    품목명,
    scalar=None
):

    raw_data = pd.read_csv(raw_file)
    신지공판장 = pd.read_csv(산지공판장_file)
    전국도매 = pd.read_csv(전국도매_file)

    conditions = {
        '감자': {
            'target': lambda df:
                (df['품종명'] == '감자 수미') &
                (df['거래단위'] == '20키로상자') &
                (df['등급'] == '상'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['감자'],
                    '품종명': ['수미'],
                    '등급명': ['상'],
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['감자'],
                    '품종명': ['수미']
                }
        },
        '건고추': {
            'target': lambda df:
                (df['품종명'] == '화건') &
                (df['거래단위'] == '30 kg') &
                (df['등급'] == '상품'),
            '공판장': None,
            '도매': None
        },
        '깐마늘(국산)': {
            'target': lambda df:
                (df['거래단위'] == '20 kg') &
                (df['등급'] == '상품'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['마늘'],
                    '품종명': ['깐마늘'],
                    '등급명': ['상']
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['마늘'],
                    '품종명': ['깐마늘']
                }
        },
        '대파': {
            'target': lambda df:
                (df['품종명'] == '대파(일반)') &
                (df['거래단위'] == '1키로단') &
                (df['등급'] == '상'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['대파'],
                    '품종명': ['대파(일반)'],
                    '등급명': ['상']
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['대파'],
                    '품종명': ['대파(일반)']
                }
        },
        '무': {
            'target': lambda df:
                (df['거래단위'] == '20키로상자') &
                (df['등급'] == '상'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['무'],
                    '품종명': ['기타무'],
                    '등급명': ['상']
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['무'],
                    '품종명': ['무']
                }
        },
        '배추': {
            'target': lambda df:
                (df['거래단위'] == '10키로망대') &
                (df['등급'] == '상'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['배추'],
                    '품종명': ['쌈배추'],
                    '등급명': ['상']
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['배추'],
                    '품종명': ['배추']
                }
        },
        '사과': {
            'target': lambda df:
                (df['품종명'].isin(['홍로', '후지'])) &
                (df['거래단위'] == '10 개') &
                (df['등급'] == '상품'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['사과'],
                    '품종명': ['후지'],
                    '등급명': ['상']
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['사과'],
                    '품종명': ['후지']
                }
        },
        '상추': {
            'target': lambda df:
                (df['품종명'] == '청') &
                (df['거래단위'] == '100 g') &
                (df['등급'] == '상품'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['상추'],
                    '품종명': ['청상추'],
                    '등급명': ['상']
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['상추'],
                    '품종명': ['청상추']
                }
        },
        '양파': {
            'target': lambda df:
                (df['품종명'] == '양파') &
                (df['거래단위'] == '1키로') &
                (df['등급'] == '상'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['양파'],
                    '품종명': ['기타양파'],
                    '등급명': ['상']
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['양파'],
                    '품종명': ['양파(일반)']
                }
        },
        '배': {
            'target': lambda df:
                (df['품종명'] == '신고') &
                (df['거래단위'] == '10 개') &
                (df['등급'] == '상품'),
            '공판장': {
                    '공판장명': ['*전국농협공판장'],
                    '품목명': ['배'],
                    '품종명': ['신고'],
                    '등급명': ['상']
                },
            '도매': {
                    '시장명': ['*전국도매시장'],
                    '품목명': ['배'],
                    '품종명': ['신고']
                }
        }
    }

    # 타겟 데이터 필터링
    raw_품목 = raw_data[raw_data['품목명'] == 품목명]
    target_mask = conditions[품목명]['target'](raw_품목)
    filtered_data = raw_품목[target_mask]

    other_data = raw_품목[~target_mask]
    unique_combinations = other_data[['품종명', '거래단위', '등급']].drop_duplicates()
    for _, row in unique_combinations.iterrows():

        print(other_data['품종명'] == row['품종명'])

        mask = (other_data['품종명'] == row['품종명'] & other_data['거래단위'] == row['거래단위'] & other_data['등급'] == row['등급'])
        temp_df = other_data[mask]
        for col in ['평년 평균가격(원)', '평균가격(원)']:
            new_col_name = f"{row['품종명']}_{row['거래단위']}_{row['등급']}_{col}"

            print(new_col_name)

            filtered_data = filtered_data.merge(
                temp_df[['시점', col]],
                on='시점',
                how='left',
                suffixes=('', f'_{new_col_name}')
            )

            print(filtered_data)

            filtered_data.rename(
                columns={f'{col}_{new_col_name}': new_col_name},
                inplace=True
            )


    return None, None

if __name__ == "__main__":
    train_data, scaler = process_data(
        "../dataset/train/train.csv",
        "../dataset/train/meta/TRAIN_산지공판장_2018-2021.csv",
        "../dataset/train/meta/TRAIN_전국도매_2018-2021.csv",
        '사과'
    )
